In [1]:
%pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: numpy in /usr/local/lib/python3.10/dist-packages (from pandasql) (1.26.4)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (from pandasql) (2.2.2)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (from pandasql) (2.0.36)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2024.2)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->pandasql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->pandasql) (3.1.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26772 sha256=2ad23d8b183da8d3e3c43f53c7be5555b40ddb5ebd39b6150db7456754ed83b8
  Stored in directory: /root/.cache/pip/wheels/e9/bc/3a/8434bdcccf5779e72894a9b24fecbdcaf97940607eaf4bcdf9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [ ]:
import pandas as pd
from pandasql import sqldf

In [ ]:
#Write a Pandasql query to select the first 10 rows of a DataFrame
data={'column1':[1,2,3,4,5,6,7,8,9,10,11,12],
      'column2':['A','B','C','D','E','F','G','K','L','M','N','O']}
df=pd.DataFrame(data)
def run_query(query):
   return sqldf(query,{"df":df})
result=run_query("SELECT * FROM df LIMIT 10")
print(result)

   column1 column2
0        1       A
1        2       B
2        3       C
3        4       D
4        5       E
5        6       F
6        7       G
7        8       K
8        9       L
9       10       M

In [ ]:
#Write a Pandasql query to select all columns for rows where the 'age' is greater than 30
data={'gender':['Male','Female','Male','Female', 'Other']}
df=pd.DataFrame(data)
unique_gender=df['gender'].unique()
print(unique_gender)

['Male' 'Female' 'Other']

In [ ]:
from pandasql import sqldf
import pandas as pd
data={'city':['New york','california','nairobi'],
      'age':[10,20,30]}
df=pd.DataFrame(data)
def run_query(query):
   return sqldf(query,{'df':df})

query = """
SELECT *
FROM df
WHERE city = 'New York' AND age < 40;
"""

result=run_query(query)
print(result)

Empty DataFrame
Columns: [city, age]
Index: []

In [ ]:
from pandasql import sqldf
import pandas as pd


data={'city':['New york','california','nairobi'],
      'age':[10,20,30]}
df=pd.DataFrame(data)

def run_query(query):
   return sqldf(query,{'df':df})

query = """
SELECT *
FROM df
WHERE city = 'New york' AND age < 40;
"""

result=run_query(query)
print(result)

       city  age
0  New york   10

In [ ]:
#Write a Pandasql query to calculate the average 'income' for each  'gender'?
data={'Gender':["Male","Female"],
      'income':[6500,9800]}
df=pd.DataFrame(data)
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("SELECT Gender ,AVG(income) FROM df GROUP BY Gender")
print(result)

   Gender  AVG(income)
0  Female       9800.0
1    Male       6500.0

In [ ]:
# Write a Pandasql query to find the maximum 'age' in the dataset?
data={'city':['New york','california','nairobi'],
      'age':[10,20,30]}
df=pd.DataFrame(data)
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("SELECT age,MAX(age) FROM df")
print(result)

   age  MAX(age)
0   30        30

In [ ]:
 #Write a Pandasql query to calculate the total 'income' for each 'state'?
data={'city':['New york','california','nairobi'],
      'income':[[1000,2000,3000],[3450,6500,7653],[6789,3542,9807]]}
df=pd.DataFrame(data)
print(df)
df_exploded=df.explode("income")
 def run_query(query):
     return sqldf(query,{'df':df_exploded})
result=run_query("SELECT city,SUM(income) FROM df GROUP BY city")
print(result)

         city              income
0    New york  [1000, 2000, 3000]
1  california  [3450, 6500, 7653]
2     nairobi  [6789, 3542, 9807]
         city  SUM(income)
0    New york         6000
1  california        17603
2     nairobi        20138

In [ ]:
 #Write a Pandasql query to find the number of individuals in each 'city'?
data={"city":["New york","california","Nairobi"],
      "individuals":[[100,200,3000],[3450,6500,7653],[6789,3542,9807]]}
df=pd.DataFrame(data)
print(df)
df_exploded=df.explode("individuals")
def run_query(query):
    return sqldf(query,{'df':df_exploded})
result=run_query("SELECT city,SUM(individuals) FROM df GROUP BY city")
print(result)

         city         individuals
0    New york    [100, 200, 3000]
1  california  [3450, 6500, 7653]
2     Nairobi  [6789, 3542, 9807]
         city  SUM(individuals)
0     Nairobi             20138
1    New york              3300
2  california             17603

In [ ]:
!pip install pandasql
import pandas as pd
from pandasql import sqldf

data = {'city': ['New york', 'california', 'nairobi'],
        'income': [[1000, 2000, 3000], [3450, 6500, 7653], [6789, 3542, 9807]]}

df = pd.DataFrame(data)

# Explode the 'income' column to create separate rows for each income value
df_exploded = df.explode('income')

def run_query(query):
    return sqldf(query, {'df': df_exploded})

result = run_query("SELECT city, SUM(income) FROM df GROUP BY city")
print(result)

Requirement already satisfied: pandasql in /usr/local/lib/python3.10/dist-packages (0.7.3)
Requirement already satisfied: numpy in /usr/local/lib/python3.10/dist-packages (from pandasql) (1.25.2)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (from pandasql) (2.0.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.10/dist-packages (from pandasql) (2.0.31)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2023.4)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/dist-packages (from pandas->pandasql) (2024.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->pandasql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy->pandasql) (3.0.3)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)
         city  SUM(income)
0    New york         6000
1  california        17603
2     nairobi        20138

In [ ]:
 # Write a Pandasql query to find the number of individuals in each 'city'?

data={'city':["Tokyo","Berlin","Oslo"],
      'individuals':[[100,200],[450,900],[200,300]]}
df=pd.DataFrame(data)
df_exploded=df.explode('individuals')
def run_query(query):
  return sqldf(query, {'df':df_exploded})
result=run_query("SELECT individuals,sum(individuals) FROM df GROUP BY city")
print(result)

   individuals  sum(individuals)
0          450              1350
1          200               500
2          100               300

In [ ]:
# Given two DataFrames, df1 and df2, each containing 'user_id' and 'email',

# a Pandasql query to perform an inner join to combine the two  DataFrames based on the 'user_id' column.
data={'user_id':[1,2,3,4],
      'email':['purity@gmail.com','kativa@gmail.com','olesi@gmail.com','masrer@gmail.com']} # Modified to store emails as strings instead of lists
df1=pd.DataFrame(data)
df2=pd.DataFrame(data)
def run_query(query):
  return sqldf(query,{'df1':df1,'df2':df2})
result=run_query("SELECT df1.user_id FROM df1 INNER JOIN df2 ON df1.user_id=df2.user_id") # Corrected the SQL syntax for the join
print(result)

   user_id
0        1
1        2
2        3
3        4

In [8]:
import pandas as pd
from pandasql import sqldf

# Create sample DataFrames
df1 = pd.DataFrame({'user_id': [1, 2, 3], 'name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'user_id': [1, 2, 3], 'email': ['alice@example.com', 'charlie@example.com', 'bob@example.com']})

# Pandasql query for inner join
query = """
SELECT *
FROM df1
INNER JOIN df2 ON df1.user_id = df2.user_id;
"""

# Execute the query using pandasql
result = sqldf(query, locals())

# Print the result
print(result)

   user_id     name  user_id                email
0        1    Alice        1    alice@example.com
1        2      Bob        2  charlie@example.com
2        3  Charlie        3      bob@example.com

In [ ]:
# Create sample DataFrames
df1 = pd.DataFrame({'user_id': [1, 2, 3], 'name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'user_id': [1, 3, 4], 'email': ['alice@example.com', 'charlie@example.com', 'bob@example.com']})
def run_query(query):
   return sqldf(query, {'df1':df1 ,'df2':df2})
result=run_query("SELECT df1.user_id FROM df1 INNER JOIN df2 ON df1.user_id=df2.user_id")
print(result)

   user_id
0        1
1        3

In [ ]:

# Write a Pandasql query to find all individuals whose 'income' is greater  than the average income in their respective 'state'.
import pandas as pd
from pandasql import sqldf
data={'individuals':['sam','peter','purity'],
      "income":[5000,3000,10000],
      "state":['Tokyo','berlin','oslo'],
      "average_income_per_state":[3500,4000,7000]}

df=pd.DataFrame(data)
def run_query(query):
  return sqldf(query,{'df':df})
top_earners=run_query("""
SELECT *
FROM df
WHERE income > average_income_per_state
GROUP BY state;
""")
print(top_earners)

  individuals  income  state  average_income_per_state
0         sam    5000  Tokyo                      3500
1      purity   10000   oslo                      7000

In [ ]:
import pandas as pd
import numpy as np

# Sample data with some income outliers in each state
data = {'id': [1, 2, 3, 4, 5, 6, 7, 8, 9],
        'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Henry', 'Ida'],
        'state': ['CA', 'CA', 'NY', 'NY', 'TX', 'TX', 'CA', 'NY', 'TX'],
        'income': [100000, 75000, 120000, 80000, 90000, 150000, 110000, 95000, 130000],
        'state_average_income':[50000,60000,100000,50000,200000,100000,150000,20000,110000]}
df = pd.DataFrame(data)
print(df)
from pandasql import sqldf
def run_query(query):
  return sqldf(query,{'df':df})

# Filter individuals with income above their state average
above_avg_income = run_query("""
SELECT name, state, income
FROM df
WHERE income > state_average_income
GROUP BY state;
""")

print(above_avg_income)

   id     name state  income  state_average_income
0   1    Alice    CA  100000                 50000
1   2      Bob    CA   75000                 60000
2   3  Charlie    NY  120000                100000
3   4    David    NY   80000                 50000
4   5      Eve    TX   90000                200000
5   6    Frank    TX  150000                100000
6   7    Grace    CA  110000                150000
7   8    Henry    NY   95000                 20000
8   9      Ida    TX  130000                110000
      name state  income
0    Alice    CA  100000
1  Charlie    NY  120000
2    Frank    TX  150000

In [ ]:
# Write a Pandasql query to find the individuals with the top 5 highest  'income' values in the DataFrame.
data={'individuals':['miley','peter','kanya','purity','tom'],
      'income':[3000,1500,2100,7000,10]}
df=pd.DataFrame(data)
def run_query(query):

  return sqldf(query,{'df':df})
top_earners =run_query("""
SELECT *
FROM df
ORDER BY income DESC
LIMIT 5;
""")

print(top_earners)

  individuals  income
0      purity    7000
1       miley    3000
2       kanya    2100
3       peter    1500
4         tom      10

In [ ]:
 # Write a Pandasql query to create a new column 'age_group' with values  'Young', 'Middle-aged', and 'Senior' based on the 'age' column.
 data={'individuals':['miley','purity','tom','kim'],
       'age':[30,20,15,2]}
 df=pd.DataFrame(data)
 def run_query(query):
   return sqldf(query, {'df':df})
age_group=run_query("""
SELECT *,
       CASE
           WHEN age BETWEEN 0 AND 15 THEN 'young'
           WHEN age BETWEEN 17 AND 20 THEN 'middle-aged'
           ELSE 'senior'
           END AS age_group
FROM df
""")

print(age_group)

  individuals  age    age_group
0       miley   30       senior
1      purity   20  middle-aged
2         tom   15        young
3         kim    2        young

In [ ]:
-import pandas as pd

# Create the DataFrame with separate columns for names and income
data = {'name': ['miley', 'peter', 'kanya', 'purity', 'tom'],
        'income': [3000, 1500, 2100, 7000, 10]}
df = pd.DataFrame(data)

def run_query(query):
  # No need to return the query itself, just the result
  return sqldf(query, {'df':df})  # Use locals() to access variables in the function

# Pandasql query to find top 5 earners
top_earners = run_query("""
SELECT *
FROM df
ORDER BY income DESC
LIMIT 5;
""")

print(top_earners)

     name  income
0  purity    7000
1   miley    3000
2   kanya    2100
3   peter    1500
4     tom      10

In [ ]:
import pandas as pd
from pandasql import sqldf

# Create the DataFrame with separate columns for names and income
data = {'name': ['miley', 'peter', 'kanya', 'purity', 'tom'],
        'income': [3000, 1500, 2100, 7000, 10]}
df = pd.DataFrame(data)

def run_query(query):
  # Pass the DataFrame 'df' to the globals() environment
  return sqldf(query, globals())

# Pandasql query to find top 5 earners
top_earners = run_query("""
SELECT *
FROM df
ORDER BY income DESC
LIMIT 5;
""")

print(top_earners)

     name  income
0  purity    7000
1   miley    3000
2   kanya    2100
3   peter    1500
4     tom      10

In [ ]:
# Write a Pandasql query to create a new column 'age_group' with values  'Young', 'Middle-aged', and 'Senior' based on the 'age' column.
data={'individuals':['miley','purity','tom','kim'],
      'age':[30,20,15,2]}
df=pd.DataFrame(data)
def run_query(query):
  return sqldf(query, {'df':df})
age_group=run_query("""
SELECT *,
       CASE
           WHEN age BETWEEN 13 AND 25 THEN 'Young'
           WHEN age BETWEEN 26 AND 50 THEN 'Middle-aged'
           ELSE 'Senior'
       END as age_group
FROM df
""") # Use a CASE statement to categorize age groups
print(age_group)

  individuals  age    age_group
0       miley   30  Middle-aged
1      purity   20        Young
2         tom   15        Young
3         kim    2       Senior

In [10]:

 # Write a Pandasql query to update the 'income' of all individuals in 'New  York' to be 10% higher.
 data={'New_york_income':[50000],'California_income':[30000],'Nairobi_income':[20000]}
 df=pd.DataFrame(data)
 print(df)
 def run_query(query):
   return sqldf(query,{'df':df})
 result=run_query("""
 SELECT *, New_york_income * 1.10 AS Increased_NY_Income
 FROM df;
 """)
 print(result)

   New_york_income  California_income  Nairobi_income
0            50000              30000           20000
   New_york_income  California_income  Nairobi_income  Increased_NY_Income
0            50000              30000           20000              55000.0

In [ ]:
# How can you replace missing values in the 'bonus' column with zeros  using Pandasql?
data={'bonus':[1000,3000,4550,567,9000]}
df=pd.DataFrame(data)
print(df)
def run_query(query):
  return sqldf(query,{'df':df})
result=
print(result)

   bonus
0   1000
1   3000
2   4550
3    567
4   9000
   bonus  COALESCE(bonus,0)
0   1000               1000
1   3000               3000
2   4550               4550
3    567                567
4   9000               9000

In [ ]:
import pandas as pd
import numpy as np

data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'income': [100000, 75000, 120000, 80000],
        'bonus': [5000, np.nan, 7000, None]}  # Include different missing value representations

df = pd.DataFrame(data)
print(df)
def replace_missing_with_zero(df):
  """
  Replaces missing values (NaN) in the 'bonus' column with zeros.
  """
  df['bonus'] = df['bonus'].fillna(0)
  return df

# Apply the function to a copy of the DataFrame (avoid modifying the original)
df_modified = replace_missing_with_zero(df.copy())

# View the modified DataFrame
print(df_modified)

      name  income   bonus
0    Alice  100000  5000.0
1      Bob   75000     NaN
2  Charlie  120000  7000.0
3    David   80000     NaN
      name  income   bonus
0    Alice  100000  5000.0
1      Bob   75000     0.0
2  Charlie  120000  7000.0
3    David   80000     0.0

In [ ]:
#How can you remove rows with missing values in any column from the DataFrame?
import numpy as np
data={'name':['Alice','Bob','Charlie','David'],
      'income':[100000,75000,120000,80000],
      'bonus':[5000,np.nan,None,None]}
df=pd.DataFrame(data)
print(df)
df_new=df.dropna(axis=0)
print(df_new)

      name  income   bonus
0    Alice  100000  5000.0
1      Bob   75000     NaN
2  Charlie  120000     NaN
3    David   80000     NaN
    name  income   bonus
0  Alice  100000  5000.0

In [ ]:
# How can you replace missing values in the 'bonus' column with zeros usingPandasql?
data={'name':['Alice','Bob','Charlie','David'],
      'income':[100000,75000,120000,80000],
      'bonus':[5000,np.nan,None,None]}
df=pd.DataFrame(data)
print(df)
df_new=df.fillna(0)
print(df_new)

      name  income   bonus
0    Alice  100000  5000.0
1      Bob   75000     NaN
2  Charlie  120000     NaN
3    David   80000     NaN
      name  income   bonus
0    Alice  100000  5000.0
1      Bob   75000     0.0
2  Charlie  120000     0.0
3    David   80000     0.0

In [ ]:
df=pd.read_csv(r'/content/toy_dataset.csv')
print(df)
df.head(15)

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

    Number    City  Gender  Age   Income Illness
0        1  Dallas    Male   41  40367.0      No
1        2  Dallas    Male   54  45084.0      No
2        3  Dallas    Male   42  52483.0      No
3        4  Dallas    Male   40  40941.0      No
4        5  Dallas    Male   46  50289.0      No
5        6  Dallas  Female   36  50786.0      No
6        7  Dallas  Female   32  33155.0      No
7        8  Dallas    Male   39  30914.0      No
8        9  Dallas    Male   51  68667.0      No
9       10  Dallas  Female   30  50082.0      No
10      11  Dallas  Female   48  41524.0     Yes
11      12  Dallas    Male   47  54777.0      No
12      13  Dallas    Male   46  62749.0      No
13      14  Dallas  Female   42  50894.0      No
14      15  Dallas  Female   61  38429.0      No

In [ ]:
df.tail()
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("SELECT City,Gender,Age FROM df")  #do not place a comma before FROM
print(result)

          City  Gender  Age
0       Dallas    Male   41
1       Dallas    Male   54
2       Dallas    Male   42
3       Dallas    Male   40
4       Dallas    Male   46
...        ...     ...  ...
149995  Austin    Male   48
149996  Austin    Male   25
149997  Austin    Male   26
149998  Austin    Male   25
149999  Austin  Female   37

[150000 rows x 3 columns]

In [ ]:
#REMOVING DUPLICATE VALUES
df.tail()
def run_query(query):
  return sqldf(query,{'df':df})

df_new=run_query("SELECT DISTINCT Age FROM df")
print(df_new)

    Age
0    41
1    54
2    42
3    40
4    46
5    36
6    32
7    39
8    51
9    30
10   48
11   47
12   61
13   43
14   27
15   38
16   35
17   57
18   33
19   58
20   64
21   44
22   34
23   45
24   55
25   63
26   59
27   26
28   56
29   62
30   31
31   49
32   53
33   29
34   28
35   25
36   37
37   65
38   60
39   50
40   52

In [ ]:
df.shape

(150000, 6)

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("SELECT COUNT(DISTINCT Age)FROM df")
print(result)

   COUNT(DISTINCT Age)
0                   41

In [ ]:
df.tail()
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT Income
FROM df
WHERE Income > 40000;
""" )
print(result)

          Income
0        40367.0
1        45084.0
2        52483.0
3        40941.0
4        50289.0
...          ...
143703   93669.0
143704   96748.0
143705  111885.0
143706  111878.0
143707   87251.0

[143708 rows x 1 columns]

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT Age
FROM df
WHERE Age BETWEEN 50 AND 60;
""")
print(result)

       Age
0       54
1       51
2       57
3       58
4       58
...    ...
40871   50
40872   51
40873   55
40874   52
40875   51

[40876 rows x 1 columns]

In [ ]:
#like finds similarities/search for a pattern
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT City
FROM df
WHERE City LIKE 'Dallas';
""")
print(result)

         City
0      Dallas
1      Dallas
2      Dallas
3      Dallas
4      Dallas
...       ...
19702  Dallas
19703  Dallas
19704  Dallas
19705  Dallas
19706  Dallas

[19707 rows x 1 columns]

In [ ]:
#in ultiple values in a column,they all share the same value
df.tail()
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT City
FROM df
WHERE City IN ('Dallas');
""")
print(result)

def run_query(query):
  return sqldf(query,{'df':df})
result1=run_query("""
SELECT Gender
FROM df
WHERE Gender IN ('Female');  #where not,where use=
""")
print(result1)

         City
0      Dallas
1      Dallas
2      Dallas
3      Dallas
4      Dallas
...       ...
19702  Dallas
19703  Dallas
19704  Dallas
19705  Dallas
19706  Dallas

[19707 rows x 1 columns]
       Gender
0      Female
1      Female
2      Female
3      Female
4      Female
...       ...
66195  Female
66196  Female
66197  Female
66198  Female
66199  Female

[66200 rows x 1 columns]

In [ ]:
df.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result1=run_query("""
SELECT Age
FROM df
WHERE Age BETWEEN 45 AND 60 ;
""")
print(result1)

       Age
0       54
1       46
2       51
3       48
4       47
...    ...
59526   51
59527   55
59528   52
59529   51
59530   48

[59531 rows x 1 columns]

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result1=run_query("""
SELECT Gender
FROM df
WHERE Gender ='Male'OR Gender ='Female' ;
""")
print(result1)

def run_query(query):
   return sqldf(query,{'df':df})
result2=run_query("""
SELECT Gender
FROM df
WHERE Gender IN ('Male','Female');
""")
print(result2)

        Gender
0         Male
1         Male
2         Male
3         Male
4         Male
...        ...
149995    Male
149996    Male
149997    Male
149998    Male
149999  Female

[150000 rows x 1 columns]
        Gender
0         Male
1         Male
2         Male
3         Male
4         Male
...        ...
149995    Male
149996    Male
149997    Male
149998    Male
149999  Female

[150000 rows x 1 columns]

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result1=run_query("""
SELECT Gender
FROM df
WHERE NOT Gender ='Male' ;
""")
print(result1)

       Gender
0      Female
1      Female
2      Female
3      Female
4      Female
...       ...
66195  Female
66196  Female
66197  Female
66198  Female
66199  Female

[66200 rows x 1 columns]

In [ ]:
#combining and,or,not
def run_query(query):
  return sqldf(query,{'df':df})
result1=run_query("""
SELECT *
FROM df
WHERE Gender ='Male' AND Income BETWEEN 45000 AND 60000 AND City='Dallas' ;
""")
print(result1)

      Number    City Gender  Age   Income Illness
0          2  Dallas   Male   54  45084.0      No
1          3  Dallas   Male   42  52483.0      No
2          5  Dallas   Male   46  50289.0      No
3         12  Dallas   Male   47  54777.0      No
4         17  Dallas   Male   27  50398.0      No
...      ...     ...    ...  ...      ...     ...
5765   19698  Dallas   Male   43  45809.0      No
5766   19699  Dallas   Male   58  47757.0      No
5767   19705  Dallas   Male   33  53190.0      No
5768   19706  Dallas   Male   37  54265.0      No
5769   19707  Dallas   Male   59  51265.0      No

[5770 rows x 6 columns]

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result1=run_query("""
SELECT *
FROM df
WHERE NOT Age =50 AND (Income =45000 OR Income=50000) AND City='Dallas' AND Gender='Female' ;
""")
print(result1)

   Number    City  Gender  Age   Income Illness
0    4628  Dallas  Female   45  45000.0      No
1   12397  Dallas  Female   53  50000.0      No
2   13560  Dallas  Female   62  50000.0      No

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE Income > 55000
ORDER BY Income DESC;
""")
print(result)

        Number             City  Gender   Age    Income Illness
0       109351    Mountain View    Male  58.0  177157.0      No
1       105282    Mountain View    Male  41.0  176746.0      No
2       109061    Mountain View    Male  61.0  173991.0      No
3       110878    Mountain View    Male  52.0  173826.0      No
4       112193    Mountain View    Male  58.0  172825.0      No
...        ...              ...     ...   ...       ...     ...
119231   14617           Dallas    Male  48.0   55007.0      No
119232    7080           Dallas    Male  25.0   55005.0      No
119233    3428           Dallas    Male  43.0   55004.0      No
119234   13295           Dallas    Male  54.0   55004.0      No
119235  124863  Washington D.C.  Female  29.0   55003.0      No

[119236 rows x 6 columns]

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
ORDER BY Age ASC;
""")
print(result)

        Number       City  Gender   Age    Income Illness
0         1357       None    None   NaN       NaN    None
1           92     Dallas  Female  25.0   34653.0      No
2          169     Dallas    Male  25.0   42719.0      No
3          176     Dallas    Male  25.0   43413.0      No
4          323     Dallas    Male  25.0   56736.0      No
...        ...        ...     ...   ...       ...     ...
135756  135486  San Diego  Female  65.0  112043.0      No
135757  135492  San Diego    Male  65.0  117432.0      No
135758  135503  San Diego  Female  65.0   70328.0      No
135759  135611  San Diego    Male  65.0  106797.0      No
135760  135701  San Diego    Male  65.0   99300.0      No

[135761 rows x 6 columns]

In [ ]:
from re import S
#INSERT INTO DF
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
""")

df.loc[df['Number']==250,['City','Gender', 'Age','Income','Illness']]=['San Diego','Female','30','48000','No']
print(df.loc[df['Number']==250])

     Number       City  Gender Age Income Illness
249     250  San Diego  Female  30  48000      No

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE City IS NULL AND Gender IS NULL AND Age IS NULL AND Income IS NULL AND Illness IS NULL;
""")
print(result)

Empty DataFrame
Columns: [Number, City, Gender, Age, Income, Illness]
Index: []

In [ ]:
def run_query(query):
    result=run_query("""
SELECT *
FROM df
WHERE City IS NOT NULL AND Gender IS NOT NULL AND Age IS NOT NULL AND Income IS NOT NULL AND Illness IS NOT NULL;
""")

print(result)

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df;
""")

df.loc[df['Number'] ==1,['City','Gender']]=['Anna' ,'Female']
print(df.loc[df['Number'] ==1])

   Number  City  Gender  Age   Income Illness
0       1  Anna  Female   41  40367.0      No

In [ ]:
data={"Name":['Purity','Alexandria','Stomzy','Ariana','Anna','Peter','Aura'],
      "Occupation":['Doctor','Engineer','Software Engineer','Nurse','Singer','Teacher','Teacher'],
      "Income":[100000,450000,78000,69000,78000,56000,40000]}
df=pd.DataFrame(data)
print(df)

         Name         Occupation  Income
0      Purity             Doctor  100000
1  Alexandria           Engineer  450000
2      Stomzy  Software Engineer   78000
3      Ariana              Nurse   69000
4        Anna             Singer   78000
5       Peter            Teacher   56000
6        Aura            Teacher   40000

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE  Income IN (78000);
""")
print(result)

     Name         Occupation  Income
0  Stomzy  Software Engineer   78000
1    Anna             Singer   78000

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE Income >= 78000;
""")
print(result)

         Name         Occupation  Income
0      Purity             Doctor  100000
1  Alexandria           Engineer  450000
2      Stomzy  Software Engineer   78000
3        Anna             Singer   78000

In [ ]:
#add column
df_new=df.loc[len(df.index)]=['Stacy','Artist',5000]
print(df_new)
print(df)

['Stacy', 'Artist', 5000]
          Name         Occupation  Income
0       Purity             Doctor  100000
1   Alexandria           Engineer  450000
2       Stomzy  Software Engineer   78000
3       Ariana              Nurse   69000
4         Anna             Singer   78000
5        Peter            Teacher   56000
6         Aura            Teacher   40000
7        Stacy             Artist    5000
8        Stacy             Artist    5000
9        Stacy             Artist    5000
10       Stacy             Artist    5000
11       Stacy             Artist    5000
12       Stacy             Artist    5000
13       Stacy             Artist    5000
14       Stacy             Artist    5000

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})

# Filter the DataFrame using .loc and assign the result to a new variable
filtered_df = df.loc[(df['Name'] == 'Stacy') & (df['Occupation'] == 'Skater') & (df['Income'] == 50000)]

# Print the filtered DataFrame
print(filtered_df)

Empty DataFrame
Columns: [Name, Occupation, Income]
Index: []

In [11]:
data={"Name":['Purity','Alexandria','Stomzy','Ariana','Anna','Peter','Aura'],
      "Occupation":['Doctor','Engineer','Software Engineer','Nurse','Singer','Teacher','Teacher'],
      "Income":[100000,450000,78000,69000,78000,56000,40000]}
df=pd.DataFrame(data)
print(df)
df.loc[len(df.index)]=['Stacy','Artist',50000]
print(df)

         Name         Occupation  Income
0      Purity             Doctor  100000
1  Alexandria           Engineer  450000
2      Stomzy  Software Engineer   78000
3      Ariana              Nurse   69000
4        Anna             Singer   78000
5       Peter            Teacher   56000
6        Aura            Teacher   40000
         Name         Occupation  Income
0      Purity             Doctor  100000
1  Alexandria           Engineer  450000
2      Stomzy  Software Engineer   78000
3      Ariana              Nurse   69000
4        Anna             Singer   78000
5       Peter            Teacher   56000
6        Aura            Teacher   40000
7       Stacy             Artist   50000

In [12]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE NOT Occupation = 'Teacher'
""")
print(result)

         Name         Occupation  Income
0      Purity             Doctor  100000
1  Alexandria           Engineer  450000
2      Stomzy  Software Engineer   78000
3      Ariana              Nurse   69000
4        Anna             Singer   78000
5       Stacy             Artist   50000

In [13]:
import numpy as np
df.loc[len(df.index)]=["Amos",np.nan,np.nan]
print(df)

         Name         Occupation    Income
0      Purity             Doctor  100000.0
1  Alexandria           Engineer  450000.0
2      Stomzy  Software Engineer   78000.0
3      Ariana              Nurse   69000.0
4        Anna             Singer   78000.0
5       Peter            Teacher   56000.0
6        Aura            Teacher   40000.0
7       Stacy             Artist   50000.0
8        Amos                NaN       NaN

In [14]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE Occupation IS NULL;
""")
print(result)

   Name Occupation Income
0  Amos       None   None

In [15]:
def run_query(query):
  return sqldf(query,{"df":df})
result=run_query("""
SELECT *
FROM df
WHERE Income IN (78000);
""")
print(result)

     Name         Occupation   Income
0  Stomzy  Software Engineer  78000.0
1    Anna             Singer  78000.0

In [19]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE Occupation IS NULL;
""")
print(result)
new_result=result.fillna(0)
new_result

   Name Occupation Income
0  Amos       None   None

<ipython-input-19-d18f8fe4e26a>:9: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_result=result.fillna(0)

   Name  Occupation  Income
0  Amos           0       0

In [ ]:
def run_query(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE Income IS NOT NULL;
""")
print(result)

         Name         Occupation    Income
0      Purity             Doctor  100000.0
1  Alexandria           Engineer  450000.0
2      Stomzy  Software Engineer   78000.0
3      Ariana              Nurse   69000.0
4        Anna             Singer   78000.0
5       Peter            Teacher   56000.0
6        Aura            Teacher   40000.0

In [23]:
def run_quey(query):
  return sqldf(query,{'df':df})
result=run_query("""
SELECT *
FROM df
WHERE Occupation ='Teacher' AND Income BETWEEN 35000 AND 55000;
""")
print(result)

   Name Occupation   Income
0  Aura    Teacher  40000.0

In [24]:
def run_quey(query):
  return sqldf(query,{'df':df})
sqldf("""
DELETE FROM df
WHERE Occupation = 'Teacher' AND Income BETWEEN 35000 AND 55000;
""")

result=run_query("""
SELECT *
FROM df;
""")
print(result)

         Name         Occupation    Income
0      Purity             Doctor  100000.0
1  Alexandria           Engineer  450000.0
2      Stomzy  Software Engineer   78000.0
3      Ariana              Nurse   69000.0
4        Anna             Singer   78000.0
5       Peter            Teacher   56000.0
6        Aura            Teacher   40000.0
7       Stacy             Artist   50000.0
8        Amos               None       NaN